app/views/trains/_form.html.erb

SELECT "railway_stations".* FROM "railway_stations"
---
    <%= form.label :currentstation, "Текущая станция"%>
    <%= form.collection_select :current_station_id, RailwayStation.all, :id, :title %>

SELECT "routes".* FROM "routes"
---
    <%= form.label :route, "Выберите маршрут"%>
    <%= form.collection_select :route_id, Route.all, :id, :title %>