app/views/trains/show.html.erb

SELECT  "routes".* FROM "routes" WHERE "routes"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
---
  <strong>На маршруте</strong>
  <% if @train.route.present? %>

SELECT  1 AS one FROM "wagons" WHERE "wagons"."train_id" = ? LIMIT ?  [["train_id", 9], ["LIMIT", 1]]
SELECT "wagons".* FROM "wagons" WHERE "wagons"."train_id" = ?  [["train_id", 10]]
SELECT COUNT(*) FROM "wagons" WHERE "wagons"."train_id" = ?  [["train_id", 10]]
SELECT COUNT(*) FROM "wagons" WHERE "wagons"."train_id" = ? AND "wagons"."type_class" = ?  [["train_id", 10], ["type_class", "Плацкарт"]]
SELECT SUM("wagons"."place_down") FROM "wagons" WHERE "wagons"."train_id" = ? AND "wagons"."type_class" = ?  [["train_id", 10], ["type_class", "Купе"]]
SELECT SUM("wagons"."place_up") FROM "wagons" WHERE "wagons"."train_id" = ? AND "wagons"."type_class" = ?  [["train_id", 10], ["type_class", "Плацкарт"]]
---
  <strong>Вагонов у поезда:</strong>
  <% if @train.wagons.present? %>
     <%= @train.wagons.count %><br>
     Плацкартных:
     <%= @train.wagons.where(type_class: 'Плацкарт').count %> |
     Нижних мест:
     <%= @train.wagons.where(type_class: 'Плацкарт').sum(:place_down)%> |
     Верхних мест:
     <%= @train.wagons.where(type_class: 'Плацкарт').sum(:place_up)%><br>