app/views/wagons/_form.html.erb

SELECT "wagons".* FROM "wagons" WHERE "wagons"."type" = ?  [["type", "type"]]
---
    <%= form.label :type, "Тип вагона"%>
    <%= form.select :type, Wagon::TYPES.invert.map{ |k,v| [k.to_s, v] } %>

SELECT "trains".* FROM "trains"
---
    <%= form.label :train, "Выберите поезд к которому прицепить вагон"%>
    <%= form.collection_select :train_id, Train.all, :id, :name %>