app/controllers/railway_stations_controller.rb

  def index
    @railway_stations = RailwayStation.all
---
SELECT "railway_stations".* FROM "railway_stations"

  def create
    @railway_station = RailwayStation.new(railway_station_params)
    if @railway_station.save
---
INSERT INTO "railway_stations" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "Москва"], ["created_at", "2017-06-21 19:13:42.986100"], ["updated_at", "2017-06-21 19:13:42.986100"]]

  def destroy
    @railway_station.destroy
---
DELETE FROM "railway_stations" WHERE "railway_stations"."id" = ?  [["id", 2]]

    def set_railway_station
      @railway_station = RailwayStation.find(params[:id])
---
SELECT  "railway_stations".* FROM "railway_stations" WHERE "railway_stations"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]