app/controllers/routes_controller.rb

  def create
    @route = Route.new(route_params)

    if @route.save
---
INSERT INTO "routes" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "123"], ["created_at", "2017-06-24 18:07:49.630883"], ["updated_at", "2017-06-24 18:07:49.630883"]]

  def update
    if @route.update(route_params)
---
UPDATE "routes" SET "title" = ?, "updated_at" = ? WHERE "routes"."id" = ?  [["title", "555"], ["updated_at", "2017-06-24 18:17:46.963784"], ["id", 7]]

  def destroy
    @route.destroy
---
DELETE FROM "routes" WHERE "routes"."id" = ?  [["id", 1]]

  def set_route
    @route = Route.find(params[:id])
---
SELECT  "routes".* FROM "routes" WHERE "railway_stations"."route" = ? AND "routes"."id" = ? LIMIT ?  [["route", 25], ["id", 27], ["LIMIT", 1]]