app/controllers/trains_controller.rb

INSERT INTO "trains" ("name", "created_at", "updated_at", "current_station_id", "route_id") VALUES (?, ?, ?, ?, ?)  [["name", 0], ["created_at", "2017-07-03 11:04:56.318977"], ["updated_at", "2017-07-03 11:04:56.318977"], ["current_station_id", 9], ["route_id", 17]]
---
  def create
    @train = Train.new(train_params)
    if @train.save

UPDATE "trains" SET "current_station_id" = ?, "route_id" = ?, "updated_at" = ? WHERE "trains"."id" = ?  [["current_station_id", 8], ["route_id", 16], ["updated_at", "2017-06-30 10:59:09.725261"], ["id", 9]]
---
  def update
    if @train.update(train_params)

DELETE FROM "trains" WHERE "trains"."id" = ?  [["id", 7]]
---
  def destroy
    @train.destroy

SELECT  "trains".* FROM "trains" WHERE "trains"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def set_train
      @train = Train.find(params[:id])