app/controllers/wagons_controller.rb

  def index
    @wagons = Wagon.all
---
SELECT "wagons".* FROM "wagons"

  def create
    @wagon = Wagon.new(wagon_params)
    if @wagon.save
---
INSERT INTO "wagons" ("place_down", "train_id", "created_at", "updated_at", "number", "side_top_place_down", "type") VALUES (?, ?, ?, ?, ?, ?, ?)  [["place_down", 1], ["train_id", 16], ["created_at", "2017-07-11 11:40:30.782716"], ["updated_at", "2017-07-11 11:40:30.782716"], ["number", 5], ["side_top_place_down", 2], ["type", "PremiumWagon"]]

  def destroy
    @wagon.destroy
---
DELETE FROM "wagons" WHERE "wagons"."type" IN ('PremiumWagon') AND "wagons"."id" = ?  [["id", 26]]

    def set_wagon
      @wagon = Wagon.find(params[:id])
---
SELECT  "wagons".* FROM "wagons" WHERE "wagons"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]