app/views/routes/_form.html.erb

SELECT "railway_stations".* FROM "railway_stations"
---
    <%= form.label :railway_station_ids, "Текущая станция"%>
    <%= form.collection_select :railway_station_ids, RailwayStation.all, :id, :title, {}, { multiple: true} %>